{
  "_name_or_path": "yzhuang/MetaTree",
  "architectures": [
    "LlamaForMetaTree"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "backward_window": 1,
  "bos_token_id": 0,
  "depth": 2,
  "eos_token_id": 1,
  "gradient_checkpointing": false,
  "hidden_act": "silu",
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "max_position_embeddings": 256,
  "max_sequence_length": 256,
  "model_type": "llama",
  "n_class": 10,
  "n_feature": 10,
  "normalize": true,
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "num_key_value_heads": 12,
  "pad_token_id": -1,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "sigma": 0.05,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.36.2",
  "use_cache": true,
  "vocab_size": 32000
}
